detached/reference/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          199;
        startFace       157807;
    }
    top
    {
        type            patch;
        physicalType    patch;
        nFaces          398;
        startFace       158006;
    }
    bottom
    {
        type            symmetryPlane;
        physicalType    symmetryPlane;
        nFaces          79;
        startFace       158404;
    }
    obstacle
    {
        type            patch;
        physicalType    patch;
        nFaces          319;
        startFace       158483;
    }
    outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          199;
        startFace       158802;
    }
    defaultFaces
    {
        type            empty;
        nFaces          158404;
        startFace       159001;
    }
)

// ************************************************************************* //
