detached/reference/system/decomposeParDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}

numberOfSubdomains 4;

method          scotch;

simpleCoeffs
{
    n               (1 4 1 );
    delta           0.001;
}

